app/views/snippets/_snippet.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "snippet_tags" ON "tags"."id" = "snippet_tags"."tag_id" WHERE "snippet_tags"."snippet_id" = $1  [["snippet_id", 1]]
---
	  	<ul class="tags">
	  	<% snippet.tags.each do |tag| %>