app/views/cheatsheets/_show.html.erb

SELECT "snippets".* FROM "snippets" INNER JOIN "cheatsheet_snippets" ON "snippets"."id" = "cheatsheet_snippets"."snippet_id" WHERE "cheatsheet_snippets"."cheatsheet_id" = $1  [["cheatsheet_id", 1]]
---
    <h2><%= cheatsheet.name %></h2>
    <% cheatsheet.snippets.each do |snippet| %>