app/controllers/cheatsheets_controller.rb

  def edit
    @cheatsheet = Cheatsheet.find(params[:id])
---
SELECT  "cheatsheets".* FROM "cheatsheets"  WHERE "cheatsheets"."id" = $1 LIMIT 1  [["id", 6]]

  def add_snippet
    @snippet = Snippet.find(params[:id])
    @user.cheatsheets.first.snippets << @snippet
    @snippet.increment!(:snip_count)
---
SELECT  "snippets".* FROM "snippets"  WHERE "snippets"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "cheatsheets".* FROM "cheatsheets"  WHERE "cheatsheets"."user_id" = $1  ORDER BY "cheatsheets"."id" ASC LIMIT 1  [["user_id", 1]]
UPDATE "snippets" SET "snip_count" = $1, "updated_at" = $2 WHERE "snippets"."id" = 2  [["snip_count", 1], ["updated_at", "2014-08-31 22:51:22.330783"]]

  def load_user_from_param
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]