app/controllers/session_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'audrey@audrey.com' LIMIT 1
---
  def create
    @search_by_title = Snippet.search(params[:q])
    @user = User.find_by_email(params[:email])