app/controllers/snippets_controller.rb

	def index
		if params[:search]
      @snippets = Snippet.search(params[:search]).order("created_at DESC")
    else
      @snippets = Snippet.all.order(snip_count: :desc)
---
SELECT "snippets".* FROM "snippets"  WHERE (title LIKE '%test%')  ORDER BY created_at DESC
SELECT "snippets".* FROM "snippets"   ORDER BY "snippets"."snip_count" DESC
SELECT COUNT(*) FROM "snippets"  WHERE (title LIKE '%test%')

	def show
		@snippet = Snippet.find(params[:id])
---
SELECT  "snippets".* FROM "snippets"  WHERE "snippets"."id" = $1 LIMIT 1  [["id", 1]]

	def create
		@user = User.find(session[:user_id])
		@snippet = @user.snippets.create(snippet_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "snippets" ("code", "created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["code", "Test"], ["created_at", "2014-08-29 16:14:06.246708"], ["title", "Test"], ["updated_at", "2014-08-29 16:14:06.246708"], ["user_id", 1]]

	def edit
		@snippet = Snippet.find(params[:id])
---
SELECT  "snippets".* FROM "snippets"  WHERE "snippets"."id" = $1 LIMIT 1  [["id", 3]]

	def update
		@snippet = Snippet.find(params[:id])
		@snippet.update(snippet_params)
---
SELECT  "snippets".* FROM "snippets"  WHERE "snippets"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "snippets" SET "code" = $1, "updated_at" = $2 WHERE "snippets"."id" = 3  [["code", "Works Still?"], ["updated_at", "2014-08-29 16:23:57.946011"]]

	def destroy
		@snippet = Snippet.find(params[:id])
		@snippet.destroy
---
SELECT  "snippets".* FROM "snippets"  WHERE "snippets"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "snippets" WHERE "snippets"."id" = $1  [["id", 3]]