app/controllers/snippets_controller.rb

	def index
		@search_by_title = Snippet.search(params[:q])
---
SELECT "snippets".* FROM "snippets"

	def show
		@search_by_title = Snippet.search(params[:q])
		@user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

	def create
		@user = User.find(session[:user_id])
		@snippet = @user.snippets.create(snippet_params)
		if @snippet.save
			tag_list = Tag.create_tags(params[:tag_list])
		  	tag_list.each do |tag_id|
		    	@snippet.snippet_tags.create(tag_id: tag_id)
---
INSERT INTO "tags" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-08-31 20:48:59.583187"], ["title", "puts"], ["updated_at", "2014-08-31 20:48:59.583187"]]
INSERT INTO "snippet_tags" ("created_at", "snippet_id", "tag_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-08-31 20:48:59.616283"], ["snippet_id", 7], ["tag_id", 1], ["updated_at", "2014-08-31 20:48:59.616283"]]