app/controllers/users_controller.rb

  def show
    @search_by_title = Snippet.search(params[:q])
    @user = User.find(params[:id])
    @cheatsheets = @user.cheatsheets.all
    @snippets = @user.cheatsheets.first.snippets
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "cheatsheets".* FROM "cheatsheets"  WHERE "cheatsheets"."user_id" = $1  [["user_id", 1]]
SELECT "snippets".* FROM "snippets" INNER JOIN "cheatsheet_snippets" ON "snippets"."id" = "cheatsheet_snippets"."snippet_id" WHERE "cheatsheet_snippets"."cheatsheet_id" = $1  [["cheatsheet_id", 1]]

  def create
    @user = User.new(user_params)
    if @user.save
      @user.cheatsheets << Cheatsheet.create(name: "New Cheatsheet")
---
INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
INSERT INTO "cheatsheets" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-08-31 22:48:38.680673"], ["name", "New Cheatsheet"], ["updated_at", "2014-08-31 22:48:38.680673"]]