app/controllers/users_controller.rb

  def edit
    @search_by_title = Snippet.search(params[:q])
    if session[:user_id] == params[:id].to_i
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 10]]

  def update
    @search_by_title = Snippet.search(params[:q])
    @user = User.find(params[:id])

    if @user.update(user_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 14]]
UPDATE "users" SET "email" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = 14  [["email", "newEmail@test.com"], ["password_digest", "$2a$04$V85I6M2/n9M4iRNYk7bXbuFyzqqM11gZc/QBiOlHszrBq24zLXqfy"], ["updated_at", "2014-08-31 21:45:04.061959"]]

  def destroy
    user = User.find(params[:id])
    user.destroy
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 20]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 20]]